#+TITLE: This is the kick start file for all my packages.
#+STARTUP: overview
* personal keymap
#+BEGIN_SRC emacs-lisp
	;; unset C- and M- digit keys
	(dotimes (n 10)
  		(global-unset-key (kbd (format "C-%d" n)))
  		(global-unset-key (kbd (format "M-%d" n)))
  	)


	(defun org-agenda-show-agenda-and-todo (&optional arg)
  		(interactive "P")
  		(org-agenda arg "c")
  		(org-agenda-fortnight-view))


	;; set up my own map
	(define-prefix-command 'z-map)
	(global-set-key (kbd "C-1") 'z-map)

	(define-key z-map (kbd "m") 'mu4e)
	(define-key z-map (kbd "e") 'bjm/elfeed-load-db-and-open)
	(define-key z-map (kbd "1") 'org-global-cycle)
	(define-key z-map (kbd "a") 'org-agenda-show-agenda-and-todo)
	(define-key z-map (kbd "s") 'flyspell-correct-word-before-point)
	(define-key z-map (kbd "i") (lambda () (interactive) (find-file "~/MyStuff/Dropbox/orgfiles/i.org")))

	;; ibuffer mode
	(global-set-key (kbd "C-x C-b") 'ibuffer)

	;; Fix the backspace problem (C-h is backspace)
	(global-set-key (kbd "C-c k e b") 'normal-erase-is-backspace-mode)

	;; Kill whole line
	(global-set-key (kbd "C-c k e k") 'kill-whole-line)

	;; copy whole line
	(global-set-key (kbd "C-c k e y") 'copy-line)

	;; recent files
	(recentf-mode 1)
	(setq recentf-max-menu-items 25)
	(global-set-key (kbd "C-c k e r") 'recentf-open-files)

	;; term/shell shortcut
    	(global-set-key "\C-c k u s" 'term/shell)

	;; backward kill line
	(global-set-key (kbd "C-c k e u") 'backward-kill-line)

	;; eval buffer
	(global-set-key (kbd "C-c k e e") 'eval-buffer)

	;; insert date
	(global-set-key (kbd "C-c k u d") 'my/insert-date)
#+END_SRC

#+RESULTS:
| lambda | nil | (interactive) | (find-file ~/MyStuff/Dropbox/orgfiles/i.org) |
